{
  "backend/main.mo": "Minimal Motoko actor exposing a no-op healthCheck query.",
  "feature_evidence.json": "Feature evidence report mapping gameplay requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of various frontend game files for reference.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color tokens and global styles.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root component applying safe-area insets and wrapping GameScreen with an orientation guard.",
  "frontend/src/game/effects/Explosion.tsx": "Explosion renderer providing hit, player, and bomb variants with deterministic ember layouts.",
  "frontend/src/game/entities/Bullet.tsx": "Bullet visual component with glow, core, and trailing effect positioned by percentage coords.",
  "frontend/src/game/entities/Obstacle.tsx": "Hexagonal obstacle renderer with size scaling and boss-specific red visual scheme.",
  "frontend/src/game/entities/PlayerJet.tsx": "React component rendering the player jet with rotation and thrust animations using layered SVG and glow effects.",
  "frontend/src/game/GameScreen.tsx": "Main game loop handling state, movement, collisions, bullets, obstacles, explosions, scoring, and transitions.",
  "frontend/src/game/hooks/useJoystickSensitivity.ts": "React hook managing joystick sensitivity with localStorage persistence and validation.",
  "frontend/src/game/physics/bounds.ts": "Utility functions to clamp positions, detect borders, and reflect velocities at playfield bounds.",
  "frontend/src/game/physics/obstacleCollisions.ts": "Elastic collision resolver for circular obstacles with separation, damping, clamping, and safety guards.",
  "frontend/src/game/physics/playerObstacleHit.ts": "Determines if a player–obstacle overlap is deep enough to count as a full collision triggering game over.",
  "frontend/src/game/physics/vectors.ts": "Vector utilities for angle conversion, velocity scaling to percentages, and offsetting positions.",
  "frontend/src/game/Playfield.tsx": "Playfield container with border, corner accents, and grid overlay for the game area.",
  "frontend/src/game/ui/GameOverlay.tsx": "UI overlay handling HUD, controls, progress bars, and state-based displays during gameplay.",
  "frontend/src/game/ui/OrientationGuard.tsx": "Component that forces landscape play, showing a rotate-device prompt when in portrait orientation.",
  "frontend/src/game/ui/ShootButton.tsx": "Touch-friendly fire button managing pointer capture to trigger start and end of firing.",
  "frontend/src/game/ui/VirtualJoystick.tsx": "Implements a touch-based virtual joystick with deadzone handling and pointer tracking to emit movement or neutral events.",
  "frontend/src/game/utils/joystickMovement.ts": "Transforms raw joystick displacement into normalized direction and curved speed factor with deadzone and speed scaling.",
  "frontend/src/game/utils/levelTimer.ts": "Provides level-based countdown duration and functions to format remaining time as a display string.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, loading, login, logout, and context provisioning for the app.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing because the game uses only client-side state.",
  "frontend/src/index.css": "Defines global styles, theme variables, and game-specific Tailwind layers and animations.",
  "frontend/src/main.tsx": "Bootstraps the app with React, query client, Internet Identity provider, and global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, game colors, containers, animations, and plugin usage.",
  "project_state.json": "Stores project metadata, known issues, and feature requirements for fixing obstacle visibility and showing a time-up message."
}