{
  "backend/main.mo": "Empty Motoko actor placeholder.",
  "feature_evidence.json": "Feature evidence report listing implemented features, referenced files, components, and test IDs.",
  "frontend-file-summaries.txt": "Lookup file containing prewritten summaries for many frontend source files.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and theme tokens for light and dark modes.",
  "frontend/index.html": "HTML entry point with root div and script tag loading the React app.",
  "frontend/src/App.tsx": "Top-level React component applying safe-area padding and wrapping GameScreen with an orientation guard.",
  "frontend/src/game/effects/Explosion.tsx": "Explosion component rendering hit, player, or bomb variants with deterministic ember patterns.",
  "frontend/src/game/entities/Bullet.tsx": "Bullet visual component showing a small rotating projectile with glow and trailing effect.",
  "frontend/src/game/entities/Obstacle.tsx": "Renders a scalable hexagon obstacle with boss-dependent styling and glow effects based on position and size.",
  "frontend/src/game/entities/PlayerJet.tsx": "Displays the player jet with rotation, thruster animations, and detailed SVG body rendering.",
  "frontend/src/game/GameScreen.tsx": "Core game controller managing state, movement, physics, collisions, leveling, and rendering of all entities.",
  "frontend/src/game/hooks/useJoystickSensitivity.ts": "React hook managing joystick sensitivity with localStorage persistence and validation.",
  "frontend/src/game/physics/bounds.ts": "Provides functions for clamping, reflecting, and checking boundary conditions for entity positions.",
  "frontend/src/game/physics/obstacleCollisions.ts": "Resolves elastic collisions between circular obstacles, applying separation and damped impulse responses.",
  "frontend/src/game/physics/playerObstacleHit.ts": "Determines whether a player–obstacle collision is a full hit based on overlap depth thresholds.",
  "frontend/src/game/physics/vectors.ts": "Utility functions for angle-to-vector conversion, pixel-to-percent velocity conversion, and offset position calculation.",
  "frontend/src/game/Playfield.tsx": "Playfield wrapper rendering the game border, corner accents, and background grid.",
  "frontend/src/game/ui/GameOverlay.tsx": "Renders the game HUD, controls, boss bar, joystick UI, and sensitivity slider depending on game state.",
  "frontend/src/game/ui/OrientationGuard.tsx": "Enforces landscape mode and displays a rotate prompt when the device is in portrait orientation.",
  "frontend/src/game/ui/ShootButton.tsx": "Renders a fire button that tracks pointer events to trigger start and end firing actions.",
  "frontend/src/game/ui/VirtualJoystick.tsx": "Implements a touch-controlled joystick with deadzone, pointer tracking, and movement callbacks.",
  "frontend/src/game/utils/joystickMovement.ts": "Converts joystick displacement into normalized direction and curved speed factor with deadzone handling.",
  "frontend/src/game/utils/levelTimer.ts": "Provides functions to compute per-level countdown duration and format time values.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and invalidates related queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and login state.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder indicating the game performs no backend queries.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive theme variables including game-specific colors and effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with query and identity providers and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom game colors, utilities, plugins, and container behavior.",
  "project_state.json": "Tracks project metadata, existing joystick sensitivity features, and a pending request to adjust sensitivity. Stores project settings, issues, notes, and feature versions."
}