{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report mapping implemented gameplay features to involved files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files and their roles in the game.",
  "frontend/index.css": "Global Tailwind-based theme variables and base styles including dark mode overrides.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Root React component rendering the full-screen GameScreen.",
  "frontend/src/game/effects/Explosion.tsx": "Explosion effect component combining flash, blast waves, embers, and smoke animations.",
  "frontend/src/game/entities/Bullet.tsx": "Bullet sprite aligned via rotation and sized responsively.",
  "frontend/src/game/entities/Obstacle.tsx": "Hexagon obstacle rendered via SVG with hazard styling and glow effects.",
  "frontend/src/game/entities/PlayerJet.tsx": "Renders the player’s jet as an SVG with animations, positioned and rotated based on game coordinates.",
  "frontend/src/game/GameScreen.tsx": "Main game loop managing player movement, bullets, obstacles, collisions, and state transitions.",
  "frontend/src/game/physics/bounds.ts": "Provides position clamping, boundary reflection, and out‑of‑bounds detection for game entities.",
  "frontend/src/game/Playfield.tsx": "Styled playfield container with decorative borders and grid overlay.",
  "frontend/src/game/ui/GameOverlay.tsx": "Displays UI screens for start, gameplay, pause, and game over, plus controls like fire and joystick.",
  "frontend/src/game/ui/VirtualJoystick.tsx": "Implements a touch‑controlled virtual joystick sending normalized movement vectors to the game.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that no backend queries are needed for the game.",
  "frontend/src/index.css": "Tailwind setup defining arcade‑style color variables, themes, and custom animations for game visuals.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom theme colors, container settings, plugins, and extended utilities for the project's UI.",
  "project_state.json": "Describes the project’s current game features, requirements, architecture notes, known issues, and versioned feature list."
}