{
  "backend/main.mo": "Minimal Motoko actor exposing a no-op health check query.",
  "feature_evidence.json": "Feature evidence report listing PWA, service worker, and install-affordance related files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing many frontend game components, physics utilities, and UI elements.",
  "frontend/index.css": "Tailwind base styles defining theme variables for light/dark modes and applying global background/foreground styling.",
  "frontend/index.html": "HTML entry with PWA metadata, manifest link, icons, and root element for the React app.",
  "frontend/public/manifest.webmanifest": "Web app manifest defining PWA name, colors, icons, display mode, and categories.",
  "frontend/public/sw.js": "Service worker implementing install, activate, cache management, and offline fetch strategies.",
  "frontend/src/App.tsx": "Root React component registering the service worker and rendering install affordance, orientation guard, and game screen.",
  "frontend/src/game/effects/Explosion.tsx": "Renders explosion effects with variants for hits, player, and bomb, using preset ember positions and layered animations.",
  "frontend/src/game/effects/ObstacleSparks.tsx": "Displays rotating spark effects around obstacles, with enhanced colors and glow for boss variants.",
  "frontend/src/game/effects/SparkBurst.tsx": "Creates a radial spark burst with variant-based intensity, colors, and an optional completion callback.",
  "frontend/src/game/entities/Bullet.tsx": "Shows a styled bullet with glow, gradient core, and trailing effect positioned and rotated in world space.",
  "frontend/src/game/entities/Obstacle.tsx": "Renders a scalable hexagonal obstacle with color variants and integrated spark effects, supporting boss visuals.",
  "frontend/src/game/entities/PlayerJet.tsx": "Renders the player jet with optional animated thruster effects and detailed SVG body, positioned and rotated in world space.",
  "frontend/src/game/GameScreen.tsx": "Main game loop managing state, player movement, bullets, obstacles, collisions, boss logic, and effects.",
  "frontend/src/game/hooks/useJoystickSensitivity.ts": "Manages joystick sensitivity with clamping and localStorage persistence via a custom hook.",
  "frontend/src/game/physics/bounds.ts": "Provides functions for clamping positions, reflecting velocity at boundaries, and checking out-of-bounds or border contact.",
  "frontend/src/game/physics/obstacleCollisions.ts": "Handles elastic collision resolution between circular obstacles with overlap separation and velocity clamping.",
  "frontend/src/game/physics/playerObstacleHit.ts": "Determines whether a player-obstacle collision qualifies as a full hit based on penetration depth.",
  "frontend/src/game/physics/vectors.ts": "Provides angle-to-vector conversion, pixel-to-percent velocity scaling, and directional position offset utilities.",
  "frontend/src/game/Playfield.tsx": "Playfield wrapper rendering border, corner accents, and grid overlay around game content.",
  "frontend/src/game/ui/GameOverlay.tsx": "Renders HUD, progress bars, controls, and game-state overlays for the playfield.",
  "frontend/src/game/ui/OrientationGuard.tsx": "Detects portrait orientation, attempts landscape lock, and shows a rotate-device prompt when needed.",
  "frontend/src/game/ui/ShootButton.tsx": "Implements a pointer-aware shoot button that triggers fire start/end events.",
  "frontend/src/game/ui/VirtualJoystick.tsx": "Implements a touch joystick with deadzone, clamped movement, and reset behavior emitting direction and magnitude.",
  "frontend/src/game/ui/zIndex.ts": "Defines z-index constants for consistent UI layering across the game.",
  "frontend/src/game/utils/joystickMovement.ts": "Transforms raw joystick input into normalized direction and curved speed factor with deadzone and sensitivity rules.",
  "frontend/src/game/utils/levelTimer.ts": "Provides level-duration calculation and simple time formatting utilities.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and persisted identity loading.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are needed for the game.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for themes, game colors, and responsive compact UI behavior.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pwa/InstallAffordance.tsx": "UI component that displays an install prompt when the PWA becomes installable and not yet dismissed.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load, checks for updates, and handles activation events.",
  "frontend/src/pwa/useInstallPrompt.ts": "Hook that captures the browser’s beforeinstallprompt event and exposes methods to trigger and track PWA installation.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors and utilities using CSS variables including game-specific color sets.",
  "project_state.json": "Metadata file describing project state, PWA feature requirements, and existing and pending features."
}