{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing implemented UI, playfield, and gameplay-bound changes with associated files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose and recent styling/gameplay adjustments.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions for theming, dark mode, and base styling.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Root component applying safe‑area padding and wrapping GameScreen with an orientation guard.",
  "frontend/src/game/effects/Explosion.tsx": "Explosion renderer providing hit, player, and bomb variants with size‑scaled flashes, waves, and embers.",
  "frontend/src/game/entities/Bullet.tsx": "Compact bullet graphic with rotation, glow, core gradient, and trailing effect.",
  "frontend/src/game/entities/Obstacle.tsx": "Renders a scalable hexagon obstacle with boss-specific colors, glow effects, and size-based styling.",
  "frontend/src/game/entities/PlayerJet.tsx": "Displays the player jet with rotation, SVG body, and animated thruster effects when thrusting.",
  "frontend/src/game/GameScreen.tsx": "Main game loop managing entities, physics, spawning, scoring, levels, and overall game state.",
  "frontend/src/game/physics/bounds.ts": "Provides clamping, boundary reflection, and out-of-bounds checks using percent-based positions.",
  "frontend/src/game/physics/obstacleCollisions.ts": "Handles elastic circular obstacle collisions with separation, damping, and percent-to-pixel conversions.",
  "frontend/src/game/physics/playerObstacleHit.ts": "Determines if a player–obstacle collision is a full hit based on overlap depth and radius thresholds.",
  "frontend/src/game/physics/vectors.ts": "Includes vector utilities for angle conversion, pixel-to-percent velocity scaling, and directional offsets.",
  "frontend/src/game/Playfield.tsx": "Playfield container with flush borders, corner accents, and a grid overlay wrapping all game entities.",
  "frontend/src/game/ui/GameOverlay.tsx": "Renders the game's HUD, boss bar, start screen, pause controls, and mobile joystick/shoot UI.",
  "frontend/src/game/ui/OrientationGuard.tsx": "Detects device orientation, attempts landscape lock, and shows a rotate prompt when in portrait.",
  "frontend/src/game/ui/ShootButton.tsx": "Button component handling pointer events to trigger firing start and end actions.",
  "frontend/src/game/ui/VirtualJoystick.tsx": "Touch joystick that computes movement vectors and resets on pointer release or external reset token.",
  "frontend/src/game/utils/levelTimer.ts": "Provides level-based duration calculation and utility to format seconds into readable time.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module indicating no backend queries are needed for the game.",
  "frontend/src/index.css": "Tailwind base styles plus custom game-themed colors, shadows, and animation utilities.",
  "frontend/src/main.tsx": "App entry point setting up React Query, Internet Identity, and global styles before rendering App.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors with game variables and enabling plugins and utilities.",
  "project_state.json": "Describes the current state of a web game project, including UI gap/compactness issues and pending PWA support, along with existing and new feature requests."
}