{
  "backend/main.mo": "Empty Motoko actor placeholder.",
  "feature_evidence.json": "Feature evidence report listing multiple gameplay/UI features with affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose in the game.",
  "frontend/index.css": "Global Tailwind and theme variable definitions including light/dark mode color tokens.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Wraps GameScreen in OrientationGuard inside a full-screen container.",
  "frontend/src/game/effects/Explosion.tsx": "Explosion component rendering hit, player, and bomb effects with deterministic ember patterns.",
  "frontend/src/game/entities/Bullet.tsx": "Bullet visual component positioned by percent coordinates and rotated to match firing angle.",
  "frontend/src/game/entities/Obstacle.tsx": "Renders a hexagon obstacle with size scaling, boss visuals, and animated SVG effects.",
  "frontend/src/game/entities/PlayerJet.tsx": "Displays the player jet with rotation, animated thruster effects, and detailed SVG body.",
  "frontend/src/game/GameScreen.tsx": "Main game logic controlling player movement, obstacles, bullets, collisions, scoring, and level flow.",
  "frontend/src/game/physics/bounds.ts": "Provides clamping, boundary reflection, and out‑of‑bounds checks for entity positions.",
  "frontend/src/game/physics/obstacleCollisions.ts": "Resolves elastic collisions between circular obstacles with separation and damped impulse.",
  "frontend/src/game/physics/playerObstacleHit.ts": "Determines whether a player–obstacle collision is a full hit based on overlap depth.",
  "frontend/src/game/physics/vectors.ts": "Contains vector helpers for angles, pixel‑to‑percent velocity conversion, and offset positioning.",
  "frontend/src/game/Playfield.tsx": "Renders the bordered playfield container with decorative corners and grid overlay.",
  "frontend/src/game/ui/GameOverlay.tsx": "Implements the HUD and controls overlay including score, timer, progress bars, and joystick input.",
  "frontend/src/game/ui/OrientationGuard.tsx": "Shows a rotate-device overlay when in portrait mode and attempts to lock orientation to landscape.",
  "frontend/src/game/ui/ShootButton.tsx": "A press-and-hold shoot button managing pointer events to trigger fire start and end callbacks.",
  "frontend/src/game/ui/VirtualJoystick.tsx": "Implements a touch joystick that tracks pointer movement, outputs normalized vectors, and resets on release.",
  "frontend/src/game/utils/levelTimer.ts": "Provides functions to compute level durations and format seconds into display strings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, providing login, logout, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module exporting nothing for game-side query handling.",
  "frontend/src/index.css": "Defines Tailwind layers and custom theme variables and utilities for the game's color and visual style.",
  "frontend/src/main.tsx": "Bootstraps the React app with query and identity providers and loads global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, plugin use, and extensive custom colors, radii, shadows, and keyframes for the frontend.",
  "project_state.json": "Project state describing mobile UI scaling and gameplay fix requirements, including visual bugs, collision issues, and landscape enforcement."
}