{
  "kind": "build_request",
  "title": "Replace jet sprite with non-image rendering, add bullet firing, and polish the game UI",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Replace the player jet rendering so it is not an image asset: update the player entity to be drawn using non-image primitives (e.g., HTML/CSS shapes and/or inline SVG) while preserving the current positioning and movement behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "jet should not be image."
        ]
      },
      "acceptanceCriteria": [
        "The player jet is no longer rendered via an <img> tag or any raster image file (e.g., /assets/generated/jet-player.dim_256x256.png is not used by the jet).",
        "The jet remains centered on the same percent-based position coordinates and continues to move smoothly as it does now.",
        "The jet remains clearly recognizable as a jet/spacecraft and includes a visually appealing glow/thruster effect consistent with the existing arcade theme."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Implement shooting mechanics so the player jet can produce/fire bullets during gameplay, including bullet spawning, forward movement, and cleanup when bullets leave the playfield. Provide a mobile-friendly control for firing bullets while the game is in the 'playing' state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "and also it should produces the bullets"
        ]
      },
      "acceptanceCriteria": [
        "While gameState is 'playing', the user can trigger firing bullets via a mobile-friendly on-screen control (and it must not interfere with the existing drag-to-move interaction).",
        "Bullets visibly originate from the jet’s nose (or forward tip) and travel upward/forward within the playfield.",
        "Bullets are removed once they exit the visible playfield bounds (no unbounded growth in bullet count during sustained firing).",
        "Firing is disabled (no new bullets spawn) when the gameState is 'idle' or 'paused'."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Improve the overall in-game UI/visual presentation to be more amazing and attractive, enhancing the start/pause/resume/restart overlays and in-game HUD while staying consistent with the existing orange/red arcade theme and keeping all user-facing text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "it should look amazing attractive UI design for user"
        ]
      },
      "acceptanceCriteria": [
        "Start and pause overlays look more polished (typography hierarchy, spacing, depth effects) while remaining readable on mobile screens.",
        "In-game UI is upgraded with at least one lightweight HUD element (e.g., a compact firing indicator/cooldown, bullets count, or minimal status strip) without cluttering the playfield.",
        "Visual enhancements do not introduce blue/purple as the primary palette; the existing arcade orange/red theme remains dominant.",
        "All user-facing strings are in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT; compose existing UI components instead.",
    "Keep the backend as a single Motoko actor (backend/main.mo). No new backend services.",
    "Do not route any game visuals through the backend; keep gameplay client-side as it is now."
  ],
  "nonGoals": [
    "Adding enemies, collisions with enemies, scoring/leaderboards, or level progression (not requested).",
    "Adding third-party authentication providers beyond Internet Identity.",
    "Adding multiplayer or real-time networking."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}