{
  "kind": "build_request",
  "title": "Adjust bullet spawn position, scale obstacles per level, and improve player jet visuals",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update bullet spawning so bullets originate from the player jet (or very close to the jet nose) rather than spawning far ahead of the player.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "bullets should be produce some near from player"
        ]
      },
      "acceptanceCriteria": [
        "When firing, new bullets appear visually at (or very near) the player jet position, aligned to the jet’s facing angle.",
        "Bullet spawn does not appear noticeably detached from the jet (e.g., no large gap in front of the jet at the moment of spawn).",
        "Bullet direction and rotation remain consistent with the player’s facing angle at the moment of firing."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Scale the number of obstacles per level in increments of 5: Level 1 spawns/contains 5 obstacles, Level 2 has 10 obstacles, Level 3 has 15 obstacles, and so on (5 * level).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "there should be multiples 5 obstacles on each level suppose in level 1 5 then in level 2 ten and so on like that"
        ]
      },
      "acceptanceCriteria": [
        "At the start of Level 1, there are 5 obstacles active in the playfield (excluding any boss entity, if bosses are separate).",
        "At the start of Level 2, there are 10 obstacles active in the playfield (excluding any boss entity, if bosses are separate).",
        "For any level N, the obstacle count target is 5*N and the game logic uses this target consistently (spawning and/or maintaining obstacles so the level difficulty scales accordingly).",
        "The level progress UI (e.g., destroyed/target) reflects the updated per-level target (5*level)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the player jet visual design so it clearly reads as a jet plane (sleek fuselage, wings, and pointed nose) and does not look like a “bud.”",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "change the player structure it is looking like a bud not like a jet plane"
        ]
      },
      "acceptanceCriteria": [
        "The player entity renders with a clearly jet-like silhouette (distinct wings and a pointed nose).",
        "The updated jet art remains correctly centered on the player position and rotates smoothly with the same facing-angle behavior as before.",
        "No visual regressions: thrust visuals still appear only when the player is moving (thrusting), and the player remains visible on common screen sizes (mobile + desktop)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files listed as immutable in SYSTEM_CONTEXT (e.g., frontend/src/main.tsx, frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/components/ui/*).",
    "Keep all backend logic (if any is added later) within the single Motoko actor at backend/main.mo; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Adding new weapons, ammo systems, power-ups, or bullet types.",
    "Introducing new authentication methods beyond Internet Identity.",
    "Adding multiplayer, real-time networking, or backend persistence for game state."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}