{
  "kind": "build_request",
  "title": "Compact UI sizing and remove playfield border gaps",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the visible gap around the playfield so the outer border sits flush to the available screen area (no padding/margin creating space outside the border), while keeping mobile safe-area insets respected.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "every thing should be in small size also border is set to corners of all side. it should not contain the gap after borders"
        ]
      },
      "acceptanceCriteria": [
        "On mobile and desktop, the playfield border touches the container edges without an extra outer gap caused by padding/margins.",
        "If safe-area padding is applied (notch/home bar), it is the only remaining spacing and it uses env(safe-area-inset-*) sizing.",
        "No horizontal/vertical scrollbars are introduced by the playfield layout changes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Adjust the playfield border/corner styling so borders are cleanly aligned to all four corners with no visual discontinuities or inset gaps at the corners (including the corner accent elements).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "border is set to corners of all side. it should not contain the gap after borders"
        ]
      },
      "acceptanceCriteria": [
        "All four corner accents visually meet the main border cleanly (no 1–2px gaps or misalignment).",
        "Rounded corners (if kept) do not cause the border or accents to look separated from the edge.",
        "The grid overlay and playfield background remain clipped correctly inside the border."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make the in-game UI more compact overall by reducing the on-screen footprint of the HUD (score/level/timer), progress bars, pause button, shoot button, and virtual joystick, while keeping them readable and touchable on mobile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "every thing should be in small size"
        ]
      },
      "acceptanceCriteria": [
        "HUD top bar uses smaller paddings/font sizes and does not overlap critical gameplay area more than before.",
        "Progress bar containers are shorter and more compact; text remains legible.",
        "Shoot button and joystick are reduced in size compared to current defaults, with adequate touch target preserved (no missed taps in normal use).",
        "No UI element is clipped off-screen in common mobile landscape sizes."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure gameplay bounds and effective playable area match the updated border/gap behavior so there is no extra 'dead space' between the visible border and the area where the player/obstacles can move (i.e., adjust any playfield padding/bounds calculations accordingly).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "it should not contain the gap after borders"
        ]
      },
      "acceptanceCriteria": [
        "Player jet can move visually close to the border consistent with collision radius (no unusually large invisible margin).",
        "Obstacle/bullet out-of-bounds behavior remains correct after any padding/bounds changes.",
        "No new collision or clamping bugs are introduced (entities do not clip through the border)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be modified: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain single-actor in backend/main.mo; no additional backend services."
  ],
  "nonGoals": [
    "Generating or providing an Android APK file.",
    "Adding third-party tooling integrations (e.g., PWABuilder automation) inside the app."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}