{
  "kind": "build_request",
  "title": "Add Progressive Web App (PWA) install + offline support for the mobile game",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add Progressive Web App metadata so the game is installable on Android (Add to Home Screen) and iOS (Add to Home Screen), launches full-screen, and has a proper app name/icon.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "How to use this application for mobile device as offline. not online like pasting the URL in browser from their need to play. I need to use like a mobile gaming application",
          "yes please"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/index.html` includes a valid manifest link and PWA-related meta tags for standalone/fullscreen launch (including Apple-specific tags).",
        "A web app manifest file exists under `frontend/public/` and includes name, short_name, start_url, display=standalone (or fullscreen), theme_color/background_color, and icon entries.",
        "When opened on a phone and installed to home screen, launching from the home screen opens without the browser URL bar (standalone app-like mode)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a service worker that precaches the built frontend assets and enables offline play after the first successful load.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "How to use this application for mobile device as offline. not online like pasting the URL in browser from their need to play. I need to use like a mobile gaming application",
          "yes please"
        ]
      },
      "acceptanceCriteria": [
        "A service worker file exists under `frontend/public/` (or another appropriate frontend-served location) and installs/activates successfully.",
        "After visiting the app once while online, the game can be reopened and played with the device in airplane mode (offline).",
        "The service worker update flow does not permanently trap users on an old cached version (i.e., it fetches updated assets on new deployments and refreshes cache appropriately)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Register the service worker from a non-immutable frontend entry point (do not modify `frontend/src/main.tsx`) so that it runs for all users.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "yes please"
        ]
      },
      "acceptanceCriteria": [
        "No changes are made to `frontend/src/main.tsx`.",
        "The service worker is registered from an allowed file (e.g., `frontend/src/App.tsx` or another new module imported by it).",
        "Service worker registration is guarded to run only in supported environments (no runtime errors in browsers without service worker support)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a small in-app install affordance (non-blocking) that helps users install the game to their home screen when the browser indicates it is installable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "I need to use like a mobile gaming application",
          "yes please"
        ]
      },
      "acceptanceCriteria": [
        "On supported browsers (e.g., Android Chrome), the app shows a minimal \"Install\" UI only when install is available; otherwise it stays hidden.",
        "Triggering install uses the browser install prompt mechanism when available and does not interrupt gameplay when dismissed.",
        "User-facing text is in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything inside `frontend/src/components/ui` (immutable paths).",
    "Keep all backend logic in the single Motoko actor (`backend/main.mo`); no additional backend services.",
    "Do not introduce third-party authentication providers; Internet Identity remains the only auth option (even if unused by the game)."
  ],
  "nonGoals": [
    "Packaging as a native app (APK/IPA), publishing to Google Play/App Store, or adding native SDK integrations.",
    "Adding push notifications or real-time networking features.",
    "Changing gameplay mechanics (movement sensitivity, obstacle sizes, scoring) as part of this PWA/offline work."
  ],
  "imageRequirements": {
    "required": [
      "Square app icon illustration with a stylized jet/arcade motif (pwa-icon.dim_512x512.png)",
      "Maskable-style square icon with safe padding for Android adaptive icons (pwa-icon-maskable.dim_512x512.png)",
      "Small app icon variant (pwa-icon.dim_192x192.png)"
    ],
    "edits": []
  }
}