{
  "kind": "build_request",
  "title": "Fix bullet direction, redesign obstacles as hexagons, and scale UI/entities for better mobile fit",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-23",
      "text": "Ensure bullets always fire and travel in the exact direction the player jet is currently facing at the moment of firing, including correct forward spawn offset from the jet nose and consistent movement direction regardless of joystick input changes after firing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "bullets should be in proper direction"
        ]
      },
      "acceptanceCriteria": [
        "When the jet rotates and the FIRE control is pressed, the bullet initial direction matches the jet facing direction at that instant.",
        "Bullets do not drift toward a new direction when the player changes joystick direction after firing.",
        "Bullets visibly originate from the front/nose of the jet (not from the center or side) across multiple facing angles (up/down/left/right/diagonal)."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Update obstacle rendering to a clear hexagon shape (no square/diamond silhouette), while preserving the existing position system (percentage-based positioning) and keeping the current arcade orange/red hazard styling and glow feel.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make obstacle hexagon shape"
        ]
      },
      "acceptanceCriteria": [
        "Each obstacle’s primary body silhouette is a hexagon (six sides) at all times.",
        "Obstacle positioning still uses the same percentage-based left/top translate(-50%,-50%) approach and continues moving/colliding as before.",
        "Obstacle visuals remain consistent with the current orange/red arcade theme (glow/high-contrast hazard look) and do not introduce blue/purple as primary colors."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Adjust overall game sizing for small mobile screens by scaling down gameplay entities (jet, bullets, obstacles) and UI controls (HUD, FIRE button, joystick) so the playfield feels less crowded and fits comfortably on typical mobile viewports without overlapping or clipping.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "every thing should be small to look in mobile device proper"
        ]
      },
      "acceptanceCriteria": [
        "On common mobile viewport sizes (e.g., ~360×640 CSS px), the jet, obstacles, and bullets appear noticeably smaller than before and remain easy to visually track.",
        "The FIRE button and joystick do not overlap each other or cover critical playfield content; both remain easy to press.",
        "Top HUD elements do not collide with borders or overlap the playfield content excessively on small screens.",
        "Collision behavior remains consistent with the resized visuals (hitboxes updated to match new apparent sizes so collisions feel fair)."
      ]
    }
  ],
  "constraints": [
    "Frontend must remain React + TypeScript + Tailwind and continue using the existing component structure (e.g., GameScreen, entities, overlay).",
    "Do not edit any files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Adding new gameplay modes, scoring systems, power-ups, or new entity types beyond resizing and obstacle shape changes.",
    "Backend (Motoko) changes or persistence; this request is frontend-only."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}