{
  "kind": "build_request",
  "title": "Further reduce virtual joystick movement sensitivity and add an in-game sensitivity control",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Further reduce the player jet movement sensitivity in response to virtual joystick input by adjusting the joystick-to-movement mapping so that full joystick deflection produces a noticeably slower movement speed and small deflections near center produce finer control.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-5"
        ],
        "quotes": [
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "Player movement speed at maximum joystick deflection is reduced compared to the current behavior (slower top speed).",
        "Small joystick movements near center result in more precise/gradual player movement (less jumpy).",
        "No changes break joystick neutral behavior (releasing the joystick stops movement promptly)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a user-adjustable joystick sensitivity control in the gameplay UI that lets the player tweak movement sensitivity without code changes, and persist the setting locally so it is retained on refresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-5"
        ],
        "quotes": [
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "A sensitivity control is available during gameplay (playing/paused states) and is labeled in English.",
        "Changing the control updates movement sensitivity immediately (no reload required).",
        "The chosen sensitivity value persists across page reloads using client-side storage (e.g., localStorage).",
        "The default sensitivity value matches the newly tuned baseline from REQ-1."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose these components instead).",
    "Do not modify the immutable auth/actor hook files listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not add backend persistence or any Motoko changes for sensitivity settings.",
    "Do not add new gameplay mechanics unrelated to joystick sensitivity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}