{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Jet Rush: bullet spawn alignment, per-level obstacle scaling, and improved jet visuals",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Spawn bullets at/near the player jet nose and aligned to the current facing angle.",
      "acceptanceCriteria": [
        "When firing, new bullets appear visually at (or very near) the player jet position, aligned to the jet’s facing angle.",
        "Bullet spawn does not appear noticeably detached from the jet (e.g., no large gap in front of the jet at the moment of spawn).",
        "Bullet direction and rotation remain consistent with the player’s facing angle at the moment of firing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/GameScreen.tsx",
          "operation": "modify",
          "description": "Adjust bullet spawn logic to originate from the jet (or very near the nose) by reducing/removing the large forward spawn offset and (if needed) deriving a small nose offset from the current jet rendering size/scale; ensure the bullet's initial rotation and velocity still use the facing-angle snapshot at fire time."
        },
        {
          "path": "frontend/src/game/physics/vectors.ts",
          "operation": "modify",
          "description": "If needed to support tighter bullet spawn placement across screen sizes, extend the position-offset helper(s) to allow a small, configurable forward offset and/or a secondary lateral offset while preserving the same angle-to-forward-vector convention used by the jet and bullet."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Scale obstacles per level to a target of 5 * level and reflect this in gameplay and UI progress.",
      "acceptanceCriteria": [
        "At the start of Level 1, there are 5 obstacles active in the playfield (excluding any boss entity, if bosses are separate).",
        "At the start of Level 2, there are 10 obstacles active in the playfield (excluding any boss entity, if bosses are separate).",
        "For any level N, the obstacle count target is 5*N and the game logic uses this target consistently (spawning and/or maintaining obstacles so the level difficulty scales accordingly).",
        "The level progress UI (e.g., destroyed/target) reflects the updated per-level target (5*level)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/GameScreen.tsx",
          "operation": "modify",
          "description": "Introduce a per-level obstacle target computed as (5 * level), spawn that many obstacles at the start of each level (when not in boss mode), and ensure any time-based obstacle spawning/maintenance respects the target (e.g., only spawn when current obstacle count is below target). Update level completion/destroyed tracking to use the same computed target."
        },
        {
          "path": "frontend/src/game/ui/GameOverlay.tsx",
          "operation": "modify",
          "description": "Ensure the overlay progress display and level-complete screen use the provided per-level target (5 * level) consistently (e.g., destroyed/target and progress bar), without relying on a hard-coded default that could diverge from gameplay."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Improve the player jet visuals to read clearly as a sleek jet plane while preserving rotation and thrust behavior.",
      "acceptanceCriteria": [
        "The player entity renders with a clearly jet-like silhouette (distinct wings and a pointed nose).",
        "The updated jet art remains correctly centered on the player position and rotates smoothly with the same facing-angle behavior as before.",
        "No visual regressions: thrust visuals still appear only when the player is moving (thrusting), and the player remains visible on common screen sizes (mobile + desktop)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/entities/PlayerJet.tsx",
          "operation": "modify",
          "description": "Update the PlayerJet rendering to use the existing generated jet sprite at frontend/public/assets/generated/jet-player.dim_256x256.png (as the primary silhouette) and layer existing thrust/glow effects appropriately; keep the same centering (translate -50%/-50%) and rotation behavior. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "If needed after switching to the sprite-based jet, tune existing jet-related utility animations/classes to ensure thrust visuals remain visible only while thrusting and do not obscure the new jet silhouette on mobile and desktop."
        }
      ]
    }
  ]
}