{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add PWA installability + offline support for the mobile game",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add PWA metadata (manifest + platform meta tags) so the game is installable and launches standalone with correct name/icons.",
      "acceptanceCriteria": [
        "`frontend/index.html` includes a valid manifest link and PWA-related meta tags for standalone/fullscreen launch (including Apple-specific tags).",
        "A web app manifest file exists under `frontend/public/` and includes name, short_name, start_url, display=standalone (or fullscreen), theme_color/background_color, and icon entries.",
        "When opened on a phone and installed to home screen, launching from the home screen opens without the browser URL bar (standalone app-like mode)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add PWA-related <link rel=\"manifest\"> plus theme-color and Apple iOS standalone/fullscreen meta tags; wire Apple touch icons referencing the generated icon assets; update the document title/app name to match the manifest."
        },
        {
          "path": "frontend/public/manifest.webmanifest",
          "operation": "create",
          "description": "Create a web app manifest defining name/short_name, start_url, display=standalone (or fullscreen), theme_color/background_color, and icon entries that reference the generated assets under frontend/public/assets/generated/."
        },
        {
          "path": "frontend/public/assets/generated/pwa-icon.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated square PWA app icon asset at this exact path and filename so it can be referenced by the manifest and HTML head tags."
        },
        {
          "path": "frontend/public/assets/generated/pwa-icon-maskable.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated maskable PWA app icon asset at this exact path and filename so it can be referenced by the manifest as purpose=maskable."
        },
        {
          "path": "frontend/public/assets/generated/pwa-icon.dim_192x192.png",
          "operation": "create",
          "description": "Add the generated small PWA icon asset at this exact path and filename so it can be referenced by the manifest for install prompts."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement a service worker that caches the app shell and built assets to enable offline play after first load, with a safe update strategy.",
      "acceptanceCriteria": [
        "A service worker file exists under `frontend/public/` (or another appropriate frontend-served location) and installs/activates successfully.",
        "After visiting the app once while online, the game can be reopened and played with the device in airplane mode (offline).",
        "The service worker update flow does not permanently trap users on an old cached version (i.e., it fetches updated assets on new deployments and refreshes cache appropriately)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/sw.js",
          "operation": "create",
          "description": "Create a service worker that caches the core app shell (e.g., navigation requests + essential static files) and uses a cache strategy for same-origin built assets so the game works offline after a first successful online load; include cache versioning and activation behavior that cleans up old caches to avoid trapping users on stale versions."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Register the service worker from a non-immutable entry point (not main.tsx) with environment guards.",
      "acceptanceCriteria": [
        "No changes are made to `frontend/src/main.tsx`.",
        "The service worker is registered from an allowed file (e.g., `frontend/src/App.tsx` or another new module imported by it).",
        "Service worker registration is guarded to run only in supported environments (no runtime errors in browsers without service worker support)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pwa/registerServiceWorker.ts",
          "operation": "create",
          "description": "Add a small service worker registration helper that checks for service worker support and only registers in supported environments; include a minimal update listener flow so new versions can be picked up without permanently pinning users to old caches."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Import and invoke the new service worker registration helper from an allowed, non-immutable entry point (e.g., within a React effect) so it runs for all users without touching frontend/src/main.tsx."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add a minimal in-app install affordance that appears only when the browser indicates the app is installable.",
      "acceptanceCriteria": [
        "On supported browsers (e.g., Android Chrome), the app shows a minimal \"Install\" UI only when install is available; otherwise it stays hidden.",
        "Triggering install uses the browser install prompt mechanism when available and does not interrupt gameplay when dismissed.",
        "User-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pwa/useInstallPrompt.ts",
          "operation": "create",
          "description": "Create a small hook that listens for the browser installability signal (e.g., beforeinstallprompt), stores the deferred prompt, and exposes state + a method to trigger the prompt when available."
        },
        {
          "path": "frontend/src/pwa/InstallAffordance.tsx",
          "operation": "create",
          "description": "Create a small, non-blocking UI component (English text) that stays hidden unless install is available, and triggers the browser install prompt via the hook without disrupting gameplay when dismissed."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Render the install affordance component in the app layout (overlayed but non-blocking) so it is available across the game experience and does not require changes to immutable files."
        }
      ]
    }
  ]
}