{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Arcade jet primitives, bullet firing, and UI polish",
  "requirements": [
    {
      "id": "REQ-7",
      "summary": "Replace the player jet image sprite with non-image primitive rendering (inline SVG/CSS) while preserving the existing percent-based positioning and smooth movement.",
      "acceptanceCriteria": [
        "The player jet is no longer rendered via an <img> tag or any raster image file (e.g., /assets/generated/jet-player.dim_256x256.png is not used by the jet).",
        "The jet remains centered on the same percent-based position coordinates and continues to move smoothly as it does now.",
        "The jet remains clearly recognizable as a jet/spacecraft and includes a visually appealing glow/thruster effect consistent with the existing arcade theme."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/entities/PlayerJet.tsx",
          "operation": "modify",
          "description": "Replace the <img> sprite with a non-image implementation (e.g., inline SVG + div layers) that keeps the same absolute positioning (left/top percent + translate(-50%, -50%)) and pointer-events-none behavior; add a recognizable jet silhouette, canopy, and a glow/thruster effect without referencing /assets/generated/jet-player.dim_256x256.png. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust arcade-themed utility classes/animations to support the new primitive jet rendering (e.g., thruster flicker, glow pulse, heat haze) while keeping orange/red as the dominant palette and ensuring effects remain readable on mobile. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Add client-side bullet firing mechanics with mobile-friendly on-screen fire control, including spawn at jet nose, movement, and cleanup outside the playfield.",
      "acceptanceCriteria": [
        "While gameState is 'playing', the user can trigger firing bullets via a mobile-friendly on-screen control (and it must not interfere with the existing drag-to-move interaction).",
        "Bullets visibly originate from the jet’s nose (or forward tip) and travel upward/forward within the playfield.",
        "Bullets are removed once they exit the visible playfield bounds (no unbounded growth in bullet count during sustained firing).",
        "Firing is disabled (no new bullets spawn) when the gameState is 'idle' or 'paused'."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/entities/Bullet.tsx",
          "operation": "create",
          "description": "Create a Bullet entity renderer using non-image primitives (e.g., small glowing div or inline SVG) designed to read well over the playfield grid and match the arcade orange/red theme. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/game/GameScreen.tsx",
          "operation": "modify",
          "description": "Implement bullet state and mechanics: spawn bullets only when gameState is 'playing', position new bullets at the jet’s forward tip, advance bullets upward per animation frame (or timed loop), and remove bullets once outside playfield bounds; render bullets inside <Playfield> alongside <PlayerJet> and ensure bullet count remains bounded during sustained fire. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/game/ui/GameOverlay.tsx",
          "operation": "modify",
          "description": "Add a mobile-friendly on-screen FIRE control shown only while playing; ensure it does not interfere with existing drag-to-move (e.g., by stopping propagation/capturing pointer events on the button area) and wire it to GameScreen’s fire handler; ensure firing is not possible in idle/paused. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add styling utilities/animations for bullets (glow, streak, subtle motion blur feel) and for the fire control’s pressed/active states, consistent with the orange/red arcade theme. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Polish the in-game UI: improve start/pause/resume/restart overlays and add a lightweight HUD element while keeping the orange/red arcade theme and English-only strings.",
      "acceptanceCriteria": [
        "Start and pause overlays look more polished (typography hierarchy, spacing, depth effects) while remaining readable on mobile screens.",
        "In-game UI is upgraded with at least one lightweight HUD element (e.g., a compact firing indicator/cooldown, bullets count, or minimal status strip) without cluttering the playfield.",
        "Visual enhancements do not introduce blue/purple as the primary palette; the existing arcade orange/red theme remains dominant.",
        "All user-facing strings are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/ui/GameOverlay.tsx",
          "operation": "modify",
          "description": "Upgrade overlay presentation (layout, typography hierarchy, depth/glow effects) for start and pause screens while keeping all strings in English; add a compact HUD element during play (e.g., bullets on-screen count and/or a simple fire cooldown/ready indicator) positioned to avoid clutter and remain mobile-readable. If adopting shadcn-ui components (e.g., Button) for consistency, compose them without modifying files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/game/GameScreen.tsx",
          "operation": "modify",
          "description": "Provide overlay/HUD with the minimal derived state it needs (e.g., bullets currently on-screen, optional cooldown/ready flag) so the HUD can render a lightweight status indicator without affecting gameplay responsiveness. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Refine arcade UI styling tokens/utilities to support improved overlays and HUD (panel gradients, subtle scanline/noise feel via CSS, readable mobile spacing) while keeping orange/red dominant and avoiding blue/purple as primary colors. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}