{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix time-expired transition rendering and show TIME UP reason",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Keep regular and boss obstacles rendered during time-expired transition states ('exploding' → 'gameover') without flicker/disappearance.",
      "acceptanceCriteria": [
        "When the countdown reaches 0, any obstacles (including the boss) that were on-screen remain rendered on the playfield during the 'exploding' transition and until the game over UI fully takes over.",
        "Boss obstacle remains rendered with its boss styling (red scheme) through the time-expired transition.",
        "Reproduction check: start a level, allow timer to expire without dying to border/obstacle, and confirm obstacles do not flicker/disappear due to state transition."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/GameScreen.tsx",
          "operation": "modify",
          "description": "Adjust playfield rendering conditions so obstacles (including boss obstacles) remain mounted/rendered not only in 'playing' but also during the 'exploding' transition (and any other non-interactive transition states needed) while gameplay updates remain paused; ensure nothing clears or conditionally hides obstacles on state change to 'exploding'/'gameover'."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Introduce a distinct time-expired loss reason and display a clear 'TIME UP!' message on the game-over overlay when the countdown reaches 0.",
      "acceptanceCriteria": [
        "If the timer reaches 0, the game over overlay shows the text \"TIME UP!\" (English, user-facing).",
        "If the game ends for other existing reasons (e.g., player hits the border), the game over overlay does not show \"TIME UP!\" and continues to show the normal game-over messaging.",
        "The 'TIME UP!' message is visible and legible above any background/blur effects on the game over overlay."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/GameScreen.tsx",
          "operation": "modify",
          "description": "Add and manage a game-over reason state (e.g., 'timeExpired' vs existing loss reasons such as 'borderHit'); update the centralized game-over trigger to accept/record a reason; set the reason to time-expired when the countdown hits 0 and to the appropriate non-time reason for existing failure paths; pass the reason into GameOverlay."
        },
        {
          "path": "frontend/src/game/ui/GameOverlay.tsx",
          "operation": "modify",
          "description": "Extend GameOverlay props to accept the game-over reason and conditionally render a prominent \"TIME UP!\" message on the gameover screen only when the reason indicates time-expired; ensure the message styling/stacking keeps it legible over the existing blurred/dimmed overlay."
        }
      ]
    }
  ]
}