{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Tune virtual joystick movement curve and add in-game sensitivity setting",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Reduce top movement speed and increase fine control near joystick center by tuning the joystick-to-movement curve and scaling.",
      "acceptanceCriteria": [
        "Player movement speed at maximum joystick deflection is reduced compared to the current behavior (slower top speed).",
        "Small joystick movements near center result in more precise/gradual player movement (less jumpy).",
        "No changes break joystick neutral behavior (releasing the joystick stops movement promptly)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/utils/joystickMovement.ts",
          "operation": "modify",
          "description": "Tune the joystick processing curve to be less sensitive: lower the max speed scaling and adjust the curve exponent/remap so small magnitudes produce finer movement while full deflection produces a noticeably slower top speed. Keep deadzone/neutral output behavior intact (speedFactor 0 at/under deadzone)."
        },
        {
          "path": "frontend/src/game/GameScreen.tsx",
          "operation": "modify",
          "description": "Update gameplay movement computation to use the newly tuned joystick mapping output for effective movement speed, ensuring releasing the joystick still promptly yields no movement (speedFactor 0) and does not introduce drift."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a labeled in-game sensitivity control (playing/paused) that updates movement immediately and persists locally across refresh, defaulting to the newly tuned baseline.",
      "acceptanceCriteria": [
        "A sensitivity control is available during gameplay (playing/paused states) and is labeled in English.",
        "Changing the control updates movement sensitivity immediately (no reload required).",
        "The chosen sensitivity value persists across page reloads using client-side storage (e.g., localStorage).",
        "The default sensitivity value matches the newly tuned baseline from REQ-1."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/hooks/useJoystickSensitivity.ts",
          "operation": "create",
          "description": "Create a small React hook to manage joystick sensitivity as a number with: (1) a default value that matches the new tuned baseline from REQ-1, (2) read-once initialization from localStorage, and (3) persistence to localStorage on change."
        },
        {
          "path": "frontend/src/game/GameScreen.tsx",
          "operation": "modify",
          "description": "Use the new sensitivity hook to obtain the current sensitivity scalar and apply it to joystick-driven movement immediately (no reload). Pass the current sensitivity and an onChange handler down to the gameplay overlay UI."
        },
        {
          "path": "frontend/src/game/ui/GameOverlay.tsx",
          "operation": "modify",
          "description": "Add an in-game sensitivity control to the existing HUD shown during playing/paused states (no new routes/pages). Use existing shadcn-ui composition patterns already present (e.g., the existing Button/Progress usage) without editing any files under frontend/src/components/ui; implement the control as a labeled UI element (e.g., a native range input + text label) that calls back to update sensitivity immediately. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}